Repository: MicaApps/Types
Catalog: Types.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr, ru_ru, zh_tw

# SearchBox.PlaceholderText
source: Search extensions or types...
ja_jp: 拡張子または種類を検索...
ko_kr: 확장명 또는 형식 검색...
ru_ru: Поиск расширений или типов...
zh_tw: 搜尋擴充功能或類型...

# EditIconButton.Content
source: Edit Icon
ja_jp: アイコンの編集
ko_kr: 아이콘 편집
ru_ru: Изменить значок
zh_tw: 編輯圖示

# RefreshButton.Content
source: Refresh
ja_jp: 更新
ko_kr: 새로 고침
ru_ru: Обновить
zh_tw: 重新整理

# SettingsButton.Content
source: Settings
ja_jp: 設定
ko_kr: 설정
ru_ru: Настройки
zh_tw: 設定

# StatusText_Loading
source: Loading...
ja_jp: 読み込み中...
ko_kr: 로드 중...
ru_ru: Загрузка...
zh_tw: 載入中...

# StatusText_Loaded
source: types loaded.
ja_jp: 個のタイプを読み込みました。
ko_kr: 개 형식이 로드되었습니다.
ru_ru: типов загружено.
zh_tw: 種類型已載入。

# ChangeIconTitle
source: Change Icon
ja_jp: アイコンの変更
ko_kr: 아이콘 변경
ru_ru: Сменить значок
zh_tw: 變更圖示

# SaveButton.Content
source: Save
ja_jp: 保存
ko_kr: 저장
ru_ru: Сохранить
zh_tw: 儲存

# ApplyButton.Content
source: Apply
ja_jp: 適用
ko_kr: 적용
ru_ru: Применить
zh_tw: 套用

# CancelButton.Content
source: Cancel
ja_jp: キャンセル
ko_kr: 취소
ru_ru: Отмена
zh_tw: 取消

# IconPathHeader
source: Icon Path
ja_jp: アイコンのパス
ko_kr: 아이콘 경로
ru_ru: Путь к значку
zh_tw: 圖示路徑

# BrowseButton.Content
source: Browse...
ja_jp: 参照...
ko_kr: 찾아보기...
ru_ru: Обзор...
zh_tw: 瀏覽...

# TypeWindow_Description.Header
source: Description
ja_jp: 説明
ko_kr: 설명
ru_ru: Описание
zh_tw: 描述

# TypeWindow_Description.PlaceholderText
source: File Type Description
ja_jp: ファイルタイプの説明
ko_kr: 파일 형식 설명
ru_ru: Описание типа файла
zh_tw: 檔案類型描述

# TypeWindow_DefaultIcon.Header
source: Default Icon
ja_jp: デフォルトアイコン
ko_kr: 기본 아이콘
ru_ru: Значок по умолчанию
zh_tw: 預設圖示

# TypeWindow_DefaultIcon.PlaceholderText
source: Path to icon file (e.g. shell32.dll,0)
ja_jp: アイコンファイルへのパス (例: shell32.dll,0)
ko_kr: 아이콘 파일 경로 (예: shell32.dll,0)
ru_ru: Путь к файлу значка (напр. shell32.dll,0)
zh_tw: 圖示檔案路徑 (例如 shell32.dll,0)

# TypeWindow_Actions.Text
source: Actions
ja_jp: アクション
ko_kr: 작업
ru_ru: Действия
zh_tw: 動作

# TypeWindow_AddAction.Content
source: Add Action
ja_jp: アクションの追加
ko_kr: 작업 추가
ru_ru: Добавить действие
zh_tw: 新增動作

# TypeWindow_Remove.Content
source: Remove
ja_jp: 削除
ko_kr: 제거
ru_ru: Удалить
zh_tw: 移除

# TypeWindow_SetDefault.Content
source: Set Default
ja_jp: デフォルトに設定
ko_kr: 기본값으로 설정
ru_ru: Установить по умолчанию
zh_tw: 設為預設

# TypeWindow_Close.Content
source: Close
ja_jp: 閉じる
ko_kr: 닫기
ru_ru: Закрыть
zh_tw: 關閉

# VerbWindow_Title.Text
source: Action Details
ja_jp: アクションの詳細
ko_kr: 작업 세부 정보
ru_ru: Подробности действия
zh_tw: 動作詳細資料

# VerbWindow_ActionID.Header
source: Action ID
ja_jp: アクション ID
ko_kr: 작업 ID
ru_ru: ID действия
zh_tw: 動作 ID

# VerbWindow_ActionID.PlaceholderText
source: Internal ID (e.g. open)
ja_jp: 内部 ID (例: open)
ko_kr: 내부 ID (예: open)
ru_ru: Внутренний ID (напр. open)
zh_tw: 內部 ID (例如 open)

# VerbWindow_MenuText.Header
source: Menu Text
ja_jp: メニューテキスト
ko_kr: 메뉴 텍스트
ru_ru: Текст меню
zh_tw: 功能表文字

# VerbWindow_MenuText.PlaceholderText
source: Text shown in context menu
ja_jp: コンテキストメニューに表示されるテキスト
ko_kr: 컨텍스트 메뉴에 표시되는 텍스트
ru_ru: Текст, отображаемый в контекстном меню
zh_tw: 在操作功能表中顯示的文字

# VerbWindow_Command.Header
source: Command
ja_jp: コマンド
ko_kr: 명령
ru_ru: Команда
zh_tw: 命令

# VerbWindow_Command.PlaceholderText
source: Application path and arguments
ja_jp: アプリケーションのパスと引数
ko_kr: 응용 프로그램 경로 및 인수
ru_ru: Путь к приложению и аргументы
zh_tw: 應用程式路徑和引數

# IconUpdated
source: Icon updated for {0}
ja_jp: {0} のアイコンを更新しました
ko_kr: {0}의 아이콘이 업데이트되었습니다.
ru_ru: Значок обновлен для {0}
zh_tw: {0} 的圖示已更新

# IconApplied
source: Icon applied for {0}
ja_jp: {0} のアイコンを適用しました
ko_kr: {0}의 아이콘이 적용되었습니다.
ru_ru: Значок применен для {0}
zh_tw: {0} 的圖示已套用

# ErrorTitle
source: Error
ja_jp: エラー
ko_kr: 오류
ru_ru: Ошибка
zh_tw: 錯誤

# IconPathPlaceholder
source: Path to icon (e.g. shell32.dll,0)
ja_jp: アイコンのパス (例: shell32.dll,0)
ko_kr: 아이콘 경로 (예: shell32.dll,0)
ru_ru: Путь к значку (напр. shell32.dll,0)
zh_tw: 圖示路徑 (例如 shell32.dll,0)
